kenyon-mitchell01/XIAO-ESP32S3-MJPEG2SD/src/EMJPEG2SD_DopamineChaser247_Version1/utilsFS.cpp
// General purpose SD card and flash storage utilities
//
// Card can be accessed using a 1 data bit or 4 data bits (if allowed by board)
// 4 data bits is potentially faster on ESP32S3 (depending on card spec) 
// but requires 3 additional pins
/* The following #defines must be declared under the relevant camera entry in camera_pins.h
   1 bit       4 bit        
   SD_MMC_CMD  SD_MMC_CMD  
   SD_MMC_CLK  SD_MMC_CLK   
   SD_MMC_D0   SD_MMC_D0    
               SD_MMC_D1     
               SD_MMC_D2    
               SD_MMC_D3    
*/
// s60sc 2021, 2022, 2025

#include "appGlobals.h"
#include <Arduino.h> // For Serial
#include <SD_MMC.h>  // For SD_MMC


// Storage settings
int sdMinCardFreeSpace = 100; // Minimum amount of card free Megabytes before sdFreeSpaceMode action is enabled
int sdFreeSpaceMode = 1; // 0 - No Check, 1 - Delete oldest dir, 2 - Upload oldest dir to FTP/HFS and then delete on SD 
bool formatIfMountFailed = true; // Auto format the file system if mount failed. Set to false to not auto format.
static int sdmmcFreq = BOARD_MAX_SDMMC_FREQ; // board specific default SD_MMC speed
static bool use1bitMode = true;
static fs::FS fp = STORAGE;

// hold sorted list of filenames/folders names in order of newest first
static std::vector<std::string> fileVec;
static auto currentDir = "/~current";
static auto previousDir = "/~previous";
static char fsType[10] = {0};

static void infoSD() {
#if (!CONFIG_IDF_TARGET_ESP32C3 && !CONFIG_IDF_TARGET_ESP32S2)
  uint8_t cardType = SD_MMC.cardType();
  if (cardType == CARD_NONE) LOG_WRN("No SD card attached");
  else {
    char typeStr[8] = "UNKNOWN";
    if (cardType == CARD_MMC) strcpy(typeStr, "MMC");
    else if (cardType == CARD_SD) strcpy(typeStr, "SDSC");
    else if (cardType == CARD_SDHC) strcpy(typeStr, "SDHC");
    LOG_INF("SD card type %s, Size: %s, using %d bit mode @ %uMHz", typeStr, fmtSize(SD_MMC.cardSize()), use1bitMode ? 1 : 4, sdmmcFreq / 1000);
  }
#endif
}

// Add this function to test SD card functionality
bool testSDCard() {
    Serial.println("Testing SD card performance...");
    
    // Create a test file
    const char* testFilename = "/sdcard/sdtest.txt";
    uint32_t startTime = millis();
    
    File testFile = SD_MMC.open(testFilename, FILE_WRITE);
    if (!testFile) {
        Serial.println("Failed to create test file");
        return false;
    }
    
    // Write 1MB of test data for more accurate measurement
    const int bufSize = 4096; // 4KB chunks for better performance
    uint8_t* testBuf = (uint8_t*)malloc(bufSize);
    if (!testBuf) {
        Serial.println("Failed to allocate test buffer");
        testFile.close();
        return false;
    }
    
    memset(testBuf, 0xAA, bufSize); // Pattern of alternating bits
    
    const int writeCount = 256; // 256 * 4KB = 1MB total
    size_t totalBytesWritten = 0;
    
    for (int i = 0; i < writeCount; i++) {
        size_t bytesWritten = testFile.write(testBuf, bufSize);
        totalBytesWritten += bytesWritten;
        if (bytesWritten != bufSize) {
            Serial.printf("Write incomplete: %d of %d bytes\n", bytesWritten, bufSize);
            break;
        }
    }
    testFile.close();
    
    uint32_t writeTime = millis() - startTime;
    float writeSpeed = (float)totalBytesWritten / writeTime * 1000 / 1024; // KB/s
    
    // Read test
    startTime = millis();
    testFile = SD_MMC.open(testFilename, FILE_READ);
    if (!testFile) {
        Serial.println("Failed to open test file for reading");
        free(testBuf);
        return false;
    }
    
    size_t totalBytesRead = 0;
    while (testFile.available()) {
        size_t bytesRead = testFile.read(testBuf, bufSize);
        totalBytesRead += bytesRead;
        if (bytesRead == 0) break;
    }
    testFile.close();
    
    uint32_t readTime = millis() - startTime;
    float readSpeed = (float)totalBytesRead / readTime * 1000 / 1024; // KB/s
    
    // Delete test file
    SD_MMC.remove(testFilename);
    free(testBuf);
    
    Serial.printf("SD Card Performance Test Results:\n");
    Serial.printf("- Write: %.2f KB/s (%u bytes in %u ms)\n", writeSpeed, totalBytesWritten, writeTime);
    Serial.printf("- Read: %.2f KB/s (%u bytes in %u ms)\n", readSpeed, totalBytesRead, readTime);
    
    return true;
}

//New prepSD_MMC() from Claude 3.7, 04/17/2025
static bool prepSD_MMC() {
    bool res = false;
#if (!CONFIG_IDF_TARGET_ESP32C3 && !CONFIG_IDF_TARGET_ESP32S2)
    if (psramFound()) heap_caps_malloc_extmem_enable(MIN_RAM);
    fileVec.reserve(1000);
    if (psramFound()) heap_caps_malloc_extmem_enable(MAX_RAM);
#if CONFIG_IDF_TARGET_ESP32S3
    Serial.println("Configuring SD card in 1-bit mode for XIAO ESP32-S3 Sense");
    Serial.printf("SD card pins: CLK=%d (GPIO7), CMD=%d (GPIO9), D0=%d (GPIO8)\n", 
                 SD_MMC_CLK, SD_MMC_CMD, SD_MMC_D0);
    
    // XIAO ESP32-S3 uses GPIO21 for CS, but SD_MMC doesn't use CS directly
    Serial.printf("Note: GPIO21 used for CS (not directly configured in SD_MMC)\n");
    
    // Update default frequency to optimize 1-bit mode
    sdmmcFreq = 25000000; // Try 25MHz for better performance
    
    // Configure pins for 1-bit mode
    SD_MMC.setPins(SD_MMC_CLK, SD_MMC_CMD, SD_MMC_D0);
    use1bitMode = true;
#endif

    // Try different frequencies for optimal performance
    uint32_t testFreqs[] = {25000000, 20000000, 16000000, 12000000}; // 25MHz, 20MHz, 16MHz, 12MHz
    bool success = false;
    
    // Try different frequencies to find the fastest stable one
    for (uint8_t i = 0; i < sizeof(testFreqs)/sizeof(testFreqs[0]) && !success; i++) {
        Serial.printf("Trying 1-bit mode with %d MHz clock...\n", testFreqs[i]/1000000);
        res = SD_MMC.begin("/sdcard", use1bitMode, formatIfMountFailed, testFreqs[i]);
        
        if (res) {
            sdmmcFreq = testFreqs[i]; // Save the successful frequency
            success = true;
            Serial.printf("SD card initialized successfully at %d MHz\n", testFreqs[i]/1000000);
        }
    }
    
    if (success) {
        Serial.printf("SD card mounted successfully in 1-bit mode at %d MHz\n", sdmmcFreq/1000000);
        fp.mkdir(DATA_DIR);
        infoSD();
        
        // Test SD card performance with optimized clock
        testSDCard();
        
        res = true;
    } else {
        LOG_WRN("SD card mount failed at all tested frequencies");
        Serial.println("SD card mount failed - check wiring and card");
        res = false;
    }
#endif
    return res;
}



     
static void listFolder(const char* rootDir) { 
  // list contents of folder
  LOG_INF("Sketch size %s", fmtSize(ESP.getSketchSize()));    
  File root = fp.open(rootDir);
  File file = root.openNextFile();
  while (file) {
    LOG_INF("File: %s, size: %s", file.path(), fmtSize(file.size()));
    file = root.openNextFile();
  }
  char totalBytes[20];
  strcpy(totalBytes, fmtSize(STORAGE.totalBytes()));
  LOG_INF("%s: %s used of %s", fsType, fmtSize(STORAGE.usedBytes()), totalBytes);
}

bool startStorage() {
  // start required storage device (SD card or flash file system)
  bool res = false;
#if (!CONFIG_IDF_TARGET_ESP32C3 && !CONFIG_IDF_TARGET_ESP32S2)
  if ((fs::SDMMCFS*)&STORAGE == &SD_MMC) {
    strcpy(fsType, "SD_MMC");
    res = prepSD_MMC();
    if (res) listFolder(DATA_DIR);
    else snprintf(startupFailure, SF_LEN, STARTUP_FAIL "Check SD card inserted");
    debugMemory("startStorage");
    return res; 
  }
#endif
  // One of SPIFFS or LittleFS
  if (!strlen(fsType)) {
#ifdef _SPIFFS_H_
    if ((fs::SPIFFSFS*)&STORAGE == &SPIFFS) {
      strcpy(fsType, "SPIFFS");
      res = SPIFFS.begin(formatIfMountFailed);
    }
#endif
#ifdef _LITTLEFS_H_
    if ((fs::LittleFSFS*)&STORAGE == &LittleFS) {
      strcpy(fsType, "LittleFS");
      res = LittleFS.begin(formatIfMountFailed);
      // create data folder if not present
      if (res) LittleFS.mkdir(DATA_DIR);
    }
#endif
    if (res) {  
      // list details of files on file system
      const char* rootDir = !strcmp(fsType, "LittleFS") ? DATA_DIR : "/";
      listFolder(rootDir);
    }
  } else {
    snprintf(startupFailure, SF_LEN, STARTUP_FAIL "Failed to mount %s", fsType);  
    dataFilesChecked = true; // disable setupAssist as no file system
  }
  debugMemory("startStorage");
  return res;
}

static void getOldestDir(char* oldestDir) {
  // get oldest folder by its date name
  File root = fp.open("/");
  File file = root.openNextFile();
  if (file) strcpy(oldestDir, file.path()); // initialise oldestDir
  while (file) {
    if (file.isDirectory() && strstr(file.name(), "System") == NULL // ignore Sys Vol Info
        && strstr(DATA_DIR, file.name()) == NULL) { // ignore data folder
      if (strcmp(oldestDir, file.path()) > 0) strcpy(oldestDir, file.path()); 
    }
    file = root.openNextFile();
  }
}

