kenyon-mitchell01/XIAO-ESP32S3-MJPEG2SD/src/EMJPEG2SD_DopamineChaser247_Version1/utilsFS.cpp
                // Create URL with query parameters for additional info
                char uploadUrl[200];
                snprintf(uploadUrl, sizeof(uploadUrl), 
                         "http://192.168.1.193:8000/upload?device=%s&size=%u&time=%u", 
                         hostName, fileSize, (uint32_t)getEpoch());
                         
                http.begin(uploadUrl);
                http.addHeader("Content-Type", "application/octet-stream");
                http.addHeader("X-Filename", file.name());
                
                // Set timeout appropriately for large files
                // Convert fileSize to integer for comparison
                int timeout = (int)(fileSize / 1024) + 10000; // 10s + 1s per KB
                if (timeout > 60000) timeout = 60000; // Cap at 60 seconds
                http.setTimeout(timeout);
                
                // Use standard POST without chunking
                const size_t CHUNK_SIZE = 8192;
                uint8_t* buffer = (uint8_t*)ps_malloc(CHUNK_SIZE);
                
                if (!buffer) {
                    LOG_WRN("Failed to allocate buffer for file upload");
                    file.close();
                    http.end();
                    continue;
                }
                
                // Read file in chunks and POST
                size_t bytesRemaining = fileSize;
                size_t pos = 0;
                bool uploadSuccess = true;
                int httpCode = HTTP_CODE_OK;
                
                // Read and upload in one go for now (simpler approach)
                // For very large files, you might need to implement chunking in a different way
                size_t totalRead = 0;
                file.seek(0);
                
                // Basic POST approach for now
                size_t bytesToRead = (fileSize < CHUNK_SIZE) ? fileSize : CHUNK_SIZE;
                size_t bytesRead = file.read(buffer, bytesToRead);
                
                if (bytesRead > 0) {
                    httpCode = http.POST(buffer, bytesRead);
                    
                    if (httpCode == HTTP_CODE_OK) {
                        LOG_INF("Successfully uploaded: %s", filepath);
                        uploadedCount++;
                    } else {
                        LOG_WRN("Upload failed, server returned: %d", httpCode);
                    }
                } else {
                    LOG_WRN("Failed to read file: %s", filepath);
                }
                
                free(buffer);
                http.end();
            } else {
                LOG_WRN("Empty file, skipping: %s", filepath);
            }
        }
        
        file.close();
        file = root.openNextFile();
    }
    
    root.close();
    LOG_INF("Upload session complete. Uploaded %d out of %d files", uploadedCount, fileCount);
}
